---
kind: other
id: Methods.T:Autodesk.Revit.DB.Extrusion
source: html/2c9705d1-6917-0a44-9864-a98e8ed8192a.htm
---
# Extrusion Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.